IRP/src/Documents/ProductionPlanning/ProductionPlanning.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionPlanning</name>
  <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
  <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
  <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
  <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
  <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>BusinessUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PlanningPeriod</name>
    <type>
      <types>CatalogRef.PlanningPeriods</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Productions</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BillOfMaterialsList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>BusinessUnit</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>ReleaseStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>MaterialStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>SemiproductStore</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>IsProduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsSemiproduct</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsMaterial</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsService</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>OutputID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>UniqueID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PlanningPeriod</name>
      <type>
        <types>CatalogRef.PlanningPeriods</types>
      </type>
    </attributes>
    <attributes>
      <name>BillOfMaterials</name>
      <type>
        <types>CatalogRef.BillOfMaterials</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisUnit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>BasisQuantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Enums/ProductionPlanningTypes/ProductionPlanningTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>ProductionPlanningTypes</name>
 <enumValues>
  <name>Planned</name>
 </enumValues>
 <enumValues>
  <name>Produced</name>
 </enumValues>
 <enumValues>
  <name>PlanAdjustment</name>
 </enumValues>
 <enumValues>
  <name>Closing</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Enums/ProductionTypes/ProductionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionTypes</name>
  <enumValues>
    <name>Product</name>
  </enumValues>
  <enumValues>
    <name>Semiproduct</name>
  </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/Stores/Stores.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Stores</name>
 <hierarchical>true</hierarchical>
 <predefined>
  <items>
   <name>Default</name>
  </items>
 </predefined>
 <attributes>
  <name>UseGoodsReceipt</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>UseShipmentConfirmation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Transit</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>NegativeStockControl</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>PrintInfo</name>
  <type>
   <types>CatalogRef.PrintInfo</types>
  </type>
 </attributes>
 <attributes>
  <name>Location</name>
  <type>
   <types>CatalogRef.ObjectLocations</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Documents/ProductionPlanning/ManagerModule.bsl
#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	AccReg  = Metadata.AccumulationRegisters;
	Tables = New Structure();
	
	BillOfMaterialsTable       = GetBillOfMaterials(Ref);
	MaterialPlanningEmptyTable = PostingServer.CreateTable(AccReg.R7020T_MaterialPlanning);
	MaterialPlanningEmptyTable.Columns.Add("IsProduct"     , New TypeDescription("Boolean"));
	MaterialPlanningEmptyTable.Columns.Add("IsSemiproduct" , New TypeDescription("Boolean"));
	MaterialPlanningEmptyTable.Columns.Add("IsMaterial"    , New TypeDescription("Boolean"));
	MaterialPlanningEmptyTable.Columns.Add("IsService"     , New TypeDescription("Boolean"));
	
	MaterialPlanningTable      = GetMaterialPlanning(BillOfMaterialsTable, MaterialPlanningEmptyTable);
	ProductionPlanningTable    = GetProductionPlanning(BillOfMaterialsTable);
	DetailingSuppliesTable     = GetDetailingSupplies(MaterialPlanningTable);
	
	Query = New Query();
	Query.TempTablesManager = Parameters.TempTablesManager;
	Query.SetParameter("ProductionPlanningTable" , ProductionPlanningTable);
	Query.SetParameter("BillOfMaterialsTable"    , BillOfMaterialsTable);
	Query.SetParameter("ProductionPlanningTable" , ProductionPlanningTable);
	Query.SetParameter("MaterialPlanningTable"   , MaterialPlanningTable);
	Query.SetParameter("DetailingSuppliesTable"  , DetailingSuppliesTable);
	Query.Text = 
	"SELECT
	|	*
	|INTO IncomingStocks
	|FROM
	|	&ProductionPlanningTable AS IncomingStocks
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO BillOfMaterials
	|FROM
	|	&BillOfMaterialsTable AS BillOfMaterialsTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO ProductionPlanning
	|FROM
	|	&ProductionPlanningTable AS ProductionPlanning
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO MaterialPlanning
	|FROM
	|	&MaterialPlanningTable AS MaterialPlanning
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	*
	|INTO DetailingSupplies
	|FROM
	|	&DetailingSuppliesTable AS DetailingSupplies";
	Query.Execute();
	
	QueryArray = GetQueryTextsSecondaryTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);

	Return Tables;
EndFunction

#Region CreatingTables

Function GetDetailingSupplies(MaterialPlanningTable)
	Query = New Query();
	Query.Text =
	"SELECT
	|	MaterialPlanningTable.Period,
	|	MaterialPlanningTable.Company,
	|	MaterialPlanningTable.BusinessUnit,
	|	MaterialPlanningTable.PlanningPeriod,
	|	MaterialPlanningTable.Store,
	|	MaterialPlanningTable.ItemKey,
	|	MaterialPlanningTable.Quantity,
	|	MaterialPlanningTable.IsProduct,
	|	MaterialPlanningTable.IsSemiproduct,
	|	MaterialPlanningTable.IsMaterial,
	|	MaterialPlanningTable.IsService
	|INTO tmp_material
	|FROM
	|	&MaterialPlanningTable AS MaterialPlanningTable
	|;
	|
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp_material.Period,
	|	tmp_material.Company,
	|	tmp_material.BusinessUnit,
	|	tmp_material.PlanningPeriod,
	|	tmp_material.Store,
	|	tmp_material.ItemKey,
	|	SUM(tmp_material.Quantity) AS EntryDemandQuantity,
	|	SUM(CASE
	|		WHEN tmp_material.IsSemiproduct = TRUE
	|			THEN tmp_material.Quantity
	|		ELSE 0
	|	END) AS NeededProduceQuantity
	|FROM
	|	tmp_material AS tmp_material
	|GROUP BY
	|	tmp_material.Period,
	|	tmp_material.Company,
	|	tmp_material.BusinessUnit,
	|	tmp_material.PlanningPeriod,
	|	tmp_material.Store,
	|	tmp_material.ItemKey";
	
	Query.SetParameter("MaterialPlanningTable", MaterialPlanningTable);
	
	QueryResult = Query.Execute();
	QueryTable =QueryResult.Unload();
	Return QueryTable;
EndFunction

Function GetProductionPlanning(BillOfMaterialsTable)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	BillOfMaterialsTable.ProductionPlanning,
	|	BillOfMaterialsTable.BusinessUnit,
	|	BillOfMaterialsTable.PlanningPeriod,
	|	BillOfMaterialsTable.ItemKey,
	|	BillOfMaterialsTable.BillOfMaterials,
	|	BillOfMaterialsTable.BasisQuantity AS Quantity,
	|	BillOfMaterialsTable.Period,
	|	BillOfMaterialsTable.Company,
	|	BillOfMaterialsTable.SurplusStore AS Store,
	|	BillOfMaterialsTable.IsProduct,
	|	BillOfMaterialsTable.IsSemiproduct,
	|	BillOfMaterialsTable.IsMaterial,
	|	BillOfMaterialsTable.IsService
	|INTO tmp
	|FROM
	|	&BillOfMaterialsTable AS BillOfMaterialsTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Period,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.BillOfMaterials,
	|	VALUE(Enum.ProductionPlanningTypes.Planned) AS PlanningType,
	|	tmp.Company,
	|	tmp.Store,
	|	tmp.ItemKey,
	|	tmp.Quantity,
	|	CASE WHEN tmp.IsProduct = TRUE THEN VALUE(Enum.ProductionTypes.Product)
	|		 WHEN tmp.IsSemiproduct = TRUE THEN VALUE(Enum.ProductionTypes.Semiproduct)
	|	END AS ProductionType,
	|	tmp.ProductionPlanning AS PlanningDocument
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.IsProduct = TRUE OR tmp.IsSemiproduct = TRUE";
	
	Query.SetParameter("BillOfMaterialsTable", BillOfMaterialsTable);
	QueryResult = Query.Execute();
	PlanningTable = QueryResult.Unload();
	Return PlanningTable;
EndFunction

Function GetMaterialPlanning(BillOfMaterialsTable, MaterialPlanningTable)
	TmpManager = New TempTablesManager();
	Query = New Query();
	Query.TempTablesManager = TmpManager;
	Query.Text = 
	"SELECT
	|	BillOfMaterialsTable.ProductionPlanning,
	|	BillOfMaterialsTable.BusinessUnit,
	|	BillOfMaterialsTable.PlanningPeriod,
	|	BillOfMaterialsTable.ItemKey,
	|	BillOfMaterialsTable.BillOfMaterials,
	|	BillOfMaterialsTable.BasisQuantity AS Quantity,
	|	BillOfMaterialsTable.Period,
	|	BillOfMaterialsTable.Company,
	|	BillOfMaterialsTable.WriteOffStore AS Store,
	|	BillOfMaterialsTable.IsProduct,
	|	BillOfMaterialsTable.IsSemiproduct,
	|	BillOfMaterialsTable.IsMaterial,
	|	BillOfMaterialsTable.IsService,
	|	BillOfMaterialsTable.InputID,
	|	BillOfMaterialsTable.OutputID,
	|	BillOfMaterialsTable.UniqueID
	|INTO tmp
	|FROM
	|	&BillOfMaterialsTable AS BillOfMaterialsTable
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp.Period,
	|	tmp.BusinessUnit,
	|	tmp.PlanningPeriod,
	|	tmp.ProductionPlanning AS PlanningDocument,
	|	tmp.BillOfMaterials,
	|	VALUE(Enum.ProductionPlanningTypes.Planned) AS PlanningType,
	|	tmp.Company,
	|	tmp.Store,
	|	tmp.ItemKey AS Production,
	|	tmp.IsProduct,
	|	tmp.IsSemiproduct,
	|	tmp.IsMaterial,
	|	tmp.IsService,
	|	tmp.OutputID,
	|	tmp.UniqueID
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.IsProduct = TRUE
	|	OR tmp.IsSemiproduct = TRUE";
	
	Query.SetParameter("BillOfMaterialsTable", BillOfMaterialsTable);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	While QuerySelection.Next() Do
		MaterialTable = GetMaterialByProduct(TmpManager, QuerySelection.OutputID, QuerySelection.UniqueID);
		For Each RowMaterial In MaterialTable Do
			NewRow = MaterialPlanningTable.Add();
			FillPropertyValues(NewRow, QuerySelection);
			NewRow.Store         = RowMaterial.Store;
			NewRow.ItemKey       = RowMaterial.ItemKey;
			NewRow.Quantity      = RowMaterial.Quantity;
			NewRow.IsProduct     = RowMaterial.IsProduct;
			NewRow.IsSemiproduct = RowMaterial.IsSemiproduct;
			NewRow.IsMaterial    = RowMaterial.IsMaterial;
			NewRow.IsService     = RowMaterial.IsService;
		EndDo;
	EndDo;
	Return MaterialPlanningTable;
EndFunction

Function GetMaterialByProduct(TmpManager, OutputID, UniqueID)
	Query = New Query();
	Query.TempTablesManager = TmpManager;
	Query.Text =
	"SELECT
	|	tmp.ItemKey,
	|	tmp.Quantity,
	|	tmp.Store,
	|	tmp.IsProduct,
	|	tmp.IsSemiproduct,
	|	tmp.IsMaterial,
	|	tmp.IsService
	|FROM
	|	tmp AS tmp
	|WHERE
	|	tmp.InputID = &OutputID
	|	AND CAST(tmp.UniqueID AS STRING(100)) = CAST(&UniqueID AS STRING(100))
	|	AND (tmp.IsMaterial = TRUE
	|	OR tmp.IsSemiproduct = TRUE)";
	Query.SetParameter("OutputID", OutputID);
	Query.SetParameter("UniqueID", UniqueID);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	Return QueryTable;
EndFunction

Function GetBillOfMaterials(Ref)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	DocBillOfMaterials.Ref AS ProductionPlanning,
	|	DocBillOfMaterials.Ref AS PlanningDocument,
	|	DocBillOfMaterials.Ref.Company AS Company,
	|	DocBillOfMaterials.Ref.Date AS Period,
	|	DocBillOfMaterials.BusinessUnit AS BusinessUnit,
	|	DocBillOfMaterials.PlanningPeriod AS PlanningPeriod,
	|	DocBillOfMaterials.ItemKey AS ItemKey,
	|	CASE
	|		WHEN DocBillOfMaterials.IsMaterial
	|			THEN DocBillOfMaterials.MaterialStore
	|		WHEN DocBillOfMaterials.IsSemiproduct
	|			THEN DocBillOfMaterials.SemiproductStore
	|		ELSE VALUE(Catalog.Stores.EmptyRef)
	|	END AS WriteoffStore,
	|	CASE
	|		WHEN DocBillOfMaterials.IsSemiproduct
	|		OR DocBillOfMaterials.IsProduct
	|			THEN DocBillOfMaterials.ReleaseStore
	|		ELSE VALUE(Catalog.Stores.EmptyRef)
	|	END AS SurplusStore,
	|	DocBillOfMaterials.IsProduct AS IsProduct,
	|	DocBillOfMaterials.IsSemiproduct AS IsSemiproduct,
	|	DocBillOfMaterials.IsMaterial AS IsMaterial,
	|	DocBillOfMaterials.IsService AS IsService,
	|	DocBillOfMaterials.InputID AS InputID,
	|	DocBillOfMaterials.OutputID AS OutputID,
	|	DocBillOfMaterials.UniqueID AS UniqueID,
	|	DocBillOfMaterials.BillOfMaterials AS BillOfMaterials,
	|	DocBillOfMaterials.Unit AS Unit,
	|	DocBillOfMaterials.Quantity AS Quantity,
	|	DocBillOfMaterials.BasisUnit AS BasisUnit,
	|	DocBillOfMaterials.BasisQuantity AS BasisQuantity
	|FROM
	|	Document.ProductionPlanning.BillOfMaterialsList AS DocBillOfMaterials
	|WHERE
	|	DocBillOfMaterials.Ref = &Ref";
	
	Query.SetParameter("Ref", Ref);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	
	Return QueryTable;
EndFunction

#EndRegion

Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map();
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;	
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map();
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Tables = PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
	Return Tables;
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return;
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined)
	Return;
EndProcedure

#EndRegion

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure();
	StrParams.Insert("Ref", Ref);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	QueryArray.Add(T7010S_BillOfMaterials());
	QueryArray.Add(R7030T_ProductionPlanning());
	QueryArray.Add(R7020T_MaterialPlanning());
	QueryArray.Add(R7010T_DetailingSupplies());
	Return QueryArray;	
EndFunction	

Function T7010S_BillOfMaterials()
	Return 
		"SELECT *
		|	INTO T7010S_BillOfMaterials
		|FROM BillOfMaterials AS BillOfMaterialsTable
		|WHERE
		|	TRUE";
EndFunction

Function R7030T_ProductionPlanning()
	Return 
		"SELECT *
		|	INTO R7030T_ProductionPlanning
		|FROM ProductionPlanning AS ProductionPlanning
		|WHERE
		|	TRUE";
EndFunction

Function R7020T_MaterialPlanning()
	Return 
		"SELECT *
		|	INTO R7020T_MaterialPlanning
		|FROM MaterialPlanning AS MaterialPlanning
		|WHERE
		|	TRUE";
EndFunction

Function R7010T_DetailingSupplies()
	Return 
		"SELECT *
		|	INTO R7010T_DetailingSupplies
		|FROM DetailingSupplies AS DetailingSupplies
		|WHERE
		|	TRUE";
EndFunction
